       IDENTIFICATION DIVISION.
       PROGRAM-ID. TTTCOBOLERO .
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ARGS       PIC X(9).
       01 BOARDSIZE  PIC 9.
       01 CELL       PIC 9.
       01 NEXTMOVE   PIC 9 VALUE ZEROS.
       01 CELLSTATUS PIC X(1).
       01 FREECELL   PIC X(9) VALUE "-".
       PROCEDURE DIVISION.
       ACCEPT ARGS FROM command-line END-ACCEPT
       MOVE 9 TO BOARDSIZE
       PERFORM VARYING CELL FROM BOARDSIZE BY -1
         UNTIL CELL = 0 OR NEXTMOVE <> 0
         MOVE ARGS(CELL:1) TO CELLSTATUS 
         IF CELLSTATUS = FREECELL
           MOVE CELL TO NEXTMOVE
           SUBTRACT 1 FROM NEXTMOVE
           DISPLAY NEXTMOVE
         END-IF
       END-PERFORM
       STOP RUN.
